# Pandas
* Overcomes the limitations of numpy arrays in dealing with labelled and missing data
* Built on top of Numpy
* Introduces Series and DataFrame datastructures, which take on most of data mining

## 1. Pandas Series
* One-dimensional array of indexed data.
* Built on top of numpy 1D array, and also has features similar to dictionaries.

In [1]:
# Pandas series differ form numpy arrays in that, we can define labels for the series index

In [2]:
import numpy as np
import pandas as pd
pd.__version__

'0.23.4'

### 1.1 Creating pandas series objects
* Can be created from a list, numpy array, or tuple, or dictionary

**Creating series from a list**

In [3]:
my_series = pd.Series([0.5,0.8,0.9,1.3,0.4]) # similar to numpy array except now we have explicit index.
my_series

0    0.5
1    0.8
2    0.9
3    1.3
4    0.4
dtype: float64

In [4]:
my_series.values # returns the value of the series

array([0.5, 0.8, 0.9, 1.3, 0.4])

In [7]:
list(my_series.index) # returns an index object. We can get the same thing through my_series.keys()

[0, 1, 2, 3, 4]

In [8]:
my_series = pd.Series([1,2,3,4], index = ["a","b","c","d"]) # index can be changed.
my_series

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
my_series.shape # It can be seen that pandas series is one-dimensional array.

(4,)

**creating series from a numpy array**

In [10]:
my_arr = np.array([8,7,6,5]) # creating Series from a numpy array
pd.Series(my_arr)

0    8
1    7
2    6
3    5
dtype: int32

**creating series from a tuple**

In [11]:
tp = (11,12,9,1)
pd.Series(tp) # Creating series from a tuple.

0    11
1    12
2     9
3     1
dtype: int64

**creating series from a dictionary**

In [12]:
my_dict = {'k1':1, 'k2':3, 'k4':5} # dictionary can be easily converted to series. keys become index, values are values.
pd.Series(my_dict)

k1    1
k2    3
k4    5
dtype: int64

In [13]:
my_series

a    1
b    2
c    3
d    4
dtype: int64

In [14]:
my_series2 = pd.Series([5,6,7,8], index = ["a","b","c","d"])
my_series2

a    5
b    6
c    7
d    8
dtype: int64

In [15]:
my_series+my_series2 # we can do element wise operations just like numpy arrays

a     6
b     8
c    10
d    12
dtype: int64

In [16]:
d3 = {"k1": 2, "k2":[1,2,3], "k3":("a","b"),"k4":{"sk1":5}}

In [17]:
d3

{'k1': 2, 'k2': [1, 2, 3], 'k3': ('a', 'b'), 'k4': {'sk1': 5}}

In [18]:
pd.Series(d3)

k1             2
k2     [1, 2, 3]
k3        (a, b)
k4    {'sk1': 5}
dtype: object

### 1.2 Indexing & Modifying Series Objects

#### 1.2.1 Indexing
* Use square brackets [] for indexing

In [19]:
my_series = pd.Series([1.5,0.2,1.3,0.4], index=['a', 'b', 'c', 'd'])
my_series

a    1.5
b    0.2
c    1.3
d    0.4
dtype: float64

In [20]:
my_series['a'] # explicit indexing by name of index (similar to indexing of a dictionary)

1.5

In [21]:
my_series[0:3] # implicit indexing from 0th row to 2nd row.

a    1.5
b    0.2
c    1.3
dtype: float64

In [23]:
my_series[3::-1] # getting the series elements in a reverse order

d    0.4
c    1.3
b    0.2
a    1.5
dtype: float64

**potential for confusion with this indexing**

In [24]:
my_series2 = pd.Series(['a', 'b', 'c', 'd', 'e'], index = [1,2,3,4,5])
my_series2

1    a
2    b
3    c
4    d
5    e
dtype: object

In [25]:
my_series2[1]

'a'

In [26]:
my_series2[1:4]

2    b
3    c
4    d
dtype: object

**best to use special indexing attributes (mainly for pandas series and dataframes)**
* .loc - for explicit indexing with names
* .iloc - for implicit indexing with row numbers or column numbers
* .ix - for mixed indexing

In [27]:
my_series2

1    a
2    b
3    c
4    d
5    e
dtype: object

In [28]:
my_series2.loc[3] # with .loc, its explicit indexing, provide actual row or index names

'c'

In [29]:
my_series2.iloc[3] # with .iloc, its implicit indexing,  provide row  index

'd'

In [31]:
my_series2.iloc[1:]

2    b
3    c
4    d
5    e
dtype: object

In [33]:
my_series2.loc[1:]

1    a
2    b
3    c
4    d
5    e
dtype: object

#### 1.2.2 Modifying Series

In [34]:
my_series2

1    a
2    b
3    c
4    d
5    e
dtype: object

In [35]:
my_series2.loc[5] = 'y'
my_series2

1    a
2    b
3    c
4    d
5    y
dtype: object

In [36]:
my_series2.append(pd.Series(['f'])) # series is one-dimensional. append can be used to add additional series elements.
#not happening in place

1    a
2    b
3    c
4    d
5    y
0    f
dtype: object

In [37]:
my_series2

1    a
2    b
3    c
4    d
5    y
dtype: object

In [38]:
my_series2.loc[6] = 'z'
my_series2

1    a
2    b
3    c
4    d
5    y
6    z
dtype: object

In [39]:
my_series2.drop(5) # drop index position 5

1    a
2    b
3    c
4    d
6    z
dtype: object

In [40]:
my_series2.drop

<bound method Series.drop of 1    a
2    b
3    c
4    d
5    y
6    z
dtype: object>

## 2. Pandas DataFrames
*  2D array with labelled data.
* Sequence of aligned Series objects.
* Generalization of numpy array with labelled data

In [41]:
# Basically each row or column is a series

### 2.1 Creating Data Frames

In [ ]:
pd.DataFrame



#### Init signature: pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

In [42]:
# DataFrames can be created by reading csv files, from from a 2D numpy array, a dictionary of series objects, 
# from a dictionary of list objects.

**Creating data frame from a 2D numpy array**

In [44]:
df = pd.DataFrame(np.random.rand(4,5))
df

          0         1         2         3         4
0  0.702405  0.767989  0.564571  0.410610  0.937543
1  0.898443  0.409962  0.913379  0.564475  0.075148
2  0.506126  0.328852  0.592942  0.992123  0.672781
3  0.210541  0.883103  0.889572  0.017528  0.424116

In [46]:
df = pd.DataFrame(np.random.rand(4,5), index = 'r1 r2 r3 r4'.split(), columns = 'c1 c2 c3 c4 c5'.split())
df

          c1        c2        c3        c4        c5
r1  0.693634  0.748373  0.489775  0.986863  0.826550
r2  0.128963  0.333153  0.516797  0.417291  0.798443
r3  0.097365  0.991204  0.169309  0.692476  0.683630
r4  0.742596  0.233953  0.305108  0.615330  0.649010

In [47]:
df.index #  We get the index (basically rownames)

Index(['r1', 'r2', 'r3', 'r4'], dtype='object')

In [48]:
df.columns # to obtain column names, df.keys() will get you the same result.

Index(['c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')

In [50]:
#df.keys()

**Creating data frame from a dictionary of lists**

In [51]:
df = pd.DataFrame({"k1":[1,2,3], "k2":["a","b","c"]}) 
# no need to specify column names, because dictionary keys are same as columns for dataframes

In [53]:
df

   k1 k2
0   1  a
1   2  b
2   3  c

**from lists**

In [54]:
df = pd.DataFrame([[1,2,3,4]]) # we need to pass a list of lists
df

   0  1  2  3
0  1  2  3  4

**from list of lists**

In [55]:
df = pd.DataFrame([[1,2,3,4],["a","b","c","d"]], index='r1,r2'.split(","), columns='c1,c2,c3,c4'.split(","))
df

   c1 c2 c3 c4
r1  1  2  3  4
r2  a  b  c  d

**Creating data frame from a dictionary of series objects**

In [56]:
d1 = {'Josh': 6, 'kevin': 5.5, 'kumar': 5.8, 'shelly': 4.9}
d2 = {'Josh': 180 , 'kevin': 150, 'kumar': 140, 'shelly': 120}
s1 = pd.Series(d1)
s2 = pd.Series(d2)
print ('s1\n', s1, '\n')
print ('s2\n', s2)

s1
 Josh      6.0
kevin     5.5
kumar     5.8
shelly    4.9
dtype: float64

s2
 Josh      180
kevin     150
kumar     140
shelly    120
dtype: int64

In [57]:
df = pd.DataFrame({'height':s1, 'weight':s2}) # created from a dictionary of series objects. 
df

        height  weight
Josh       6.0     180
kevin      5.5     150
kumar      5.8     140
shelly     4.9     120

In [59]:
df = pd.DataFrame({'height':d1, 'weight':d2}) # it can also be created from a dictionary of dictionaries
df

        height  weight
Josh       6.0     180
kevin      5.5     150
kumar      5.8     140
shelly     4.9     120

**Creating data frame by reading data from a csv file (pd.read_csv)**

In [60]:
pwd

'C:\\Users\\sridh\\Google Drive\\Emory-ECE\\Consort-Institute\\Python-March2019\\DataAnalysis-Python'

In [61]:
df = pd.read_csv('Wine.csv') # this is the more common way, we will deal with data frames

In [62]:
df.shape # to get the dimensions. Similar to dim(df) in R

(178, 15)

In [68]:
df.head(3) # show first few rows. Similar to head(df) in R

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,3,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185

**df.info()** will give a brief info on data frame columns and types. similar to str(df) in R 

**df.describe()** will give brief staistics on all numeric type columns. similar to summary(df) in R

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178 entries, 0 to 177
Data columns (total 15 columns):
Unnamed: 0         178 non-null int64
Type               178 non-null int64
Alcohol            178 non-null float64
Malic              178 non-null float64
Ash                178 non-null float64
Alcalinity         178 non-null float64
Magnesium          178 non-null int64
Phenols            178 non-null float64
Flavanoids         178 non-null float64
Nonflavanoids      178 non-null float64
Proanthocyanins    178 non-null float64
Color              178 non-null float64
Hue                178 non-null float64
Dilution           178 non-null float64
Proline            178 non-null int64
dtypes: float64(11), int64(4)
memory usage: 20.9 KB

In [71]:
df.describe() # brief statistics

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
count,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000
mean,89.500000,1.938202,13.000618,2.336348,2.366517,19.494944,99.741573,2.295112,2.029270,0.361854,1.590899,5.058090,0.957449,2.611685,746.893258
std,51.528309,0.775035,0.811827,1.117146,0.274344,3.339564,14.282484,0.625851,0.998859,0.124453,0.572359,2.318286,0.228572,0.709990,314.907474
min,1.000000,1.000000,11.030000,0.740000,1.360000,10.600000,70.000000,0.980000,0.340000,0.130000,0.410000,1.280000,0.480000,1.270000,278.000000
25%,45.250000,1.000000,12.362500,1.602500,2.210000,17.200000,88.000000,1.742500,1.205000,0.270000,1.250000,3.220000,0.782500,1.937500,500.500000
50%,89.500000,2.000000,13.050000,1.865000,2.360000,19.500000,98.000000,2.355000,2.135000,0.340000,1.555000,4.690000,0.965000,2.780000,673.500000
75%,133.750000,3.000000,13.677500,3.082500,2.557500,21.500000,107.000000,2.800000,2.875000,0.437500,1.950000,6.200000,1.120000,3.170000,985.000000
max,178.000000,3.000000,14.830000,5.800000,3.230000,30.000000,162.000000,3.880000,5.080000,0.660000,3.580000,13.000000,1.710000,4.000000,1680.000000

**methods have df.(), and others just df.    This is because methods use df.method(), and attributes just df.attribute**

**Method does some kind of action. attributes just state some info on the data frame.**

### 2.2 Indexing/slicing/ DataFrame
    - df.loc[] for explicit indexing on rows and columns (with names)
    - df.iloc[] for implicit indexing on rows and columns (with index position)
    - df[] for explicit indexing with column names

In [72]:
df.head(3)

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,3,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185

In [74]:
df['Alcohol'].head() # to get a particular column

0    14.23
1    13.20
2    13.16
3    14.37
4    13.24
Name: Alcohol, dtype: float64

In [77]:
df[["Alcohol","Phenols"]].head(3) # pass a list of columns.  In R we use c("c1","c4")

   Alcohol  Phenols
0    14.23     2.80
1    13.20     2.65
2    13.16     2.80

In [78]:
df[1] # to index on rows, better to use .loc, and .iloc.

KeyError: 1

In [79]:
rnames = ['r' + str(i) for i in range(0,178)] # creating a list of row names
df.index = rnames # assign these row names to df index
df.head()

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
r0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
r1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
r2,3,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
r3,4,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
r4,5,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [80]:
df.loc['r3'] # use .loc to explict indexing on rows. for explicit indexing on columns .loc is not needed. But better to use .loc

Unnamed: 0            4.00
Type                  1.00
Alcohol              14.37
Malic                 1.95
Ash                   2.50
Alcalinity           16.80
Magnesium           113.00
Phenols               3.85
Flavanoids            3.49
Nonflavanoids         0.24
Proanthocyanins       2.18
Color                 7.80
Hue                   0.86
Dilution              3.45
Proline            1480.00
Name: r3, dtype: float64

In [81]:
df.loc['r3',:] # row 'r3', all columns. Also better to use ',' between rows and columns

Unnamed: 0            4.00
Type                  1.00
Alcohol              14.37
Malic                 1.95
Ash                   2.50
Alcalinity           16.80
Magnesium           113.00
Phenols               3.85
Flavanoids            3.49
Nonflavanoids         0.24
Proanthocyanins       2.18
Color                 7.80
Hue                   0.86
Dilution              3.45
Proline            1480.00
Name: r3, dtype: float64

In [82]:
df.head()

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
r0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
r1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
r2,3,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
r3,4,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
r4,5,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [84]:
df.iloc[2:4,1:4].head() # to get 2,3 rows and 1,2,3 columns

    Type  Alcohol  Malic
r2     1    13.16   2.36
r3     1    14.37   1.95

In [85]:
df.loc[['r3','r4','r5'],['Alcohol', 'Malic', 'Ash']].head() 
# when selecting multiple columns or rows, pass as a list. Also use .loc for indexing with names

    Alcohol  Malic   Ash
r3    14.37   1.95  2.50
r4    13.24   2.59  2.87
r5    14.20   1.76  2.45

### 2.3 Few important dataframe methods

In [86]:
df.head(3)

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
r0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
r1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
r2,3,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185

**df.max(), df.min(), df.sum(), df.mean(), df.idxmax(), df.idxmin() and many more**

**df.max()**

In [87]:
df['Alcohol'].max() # to get the maximum value of a particular column

14.83

In [88]:
df.head(3)

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
r0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
r1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
r2,3,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185

In [91]:
df.max(axis=0) # df.max(axis=0 or 1) to get the maximum value along each column or row. By default axis = 0
#axis = 0 will collapse values along rows, axis =1 will collapse along columns

Unnamed: 0          178.00
Type                  3.00
Alcohol              14.83
Malic                 5.80
Ash                   3.23
Alcalinity           30.00
Magnesium           162.00
Phenols               3.88
Flavanoids            5.08
Nonflavanoids         0.66
Proanthocyanins       3.58
Color                13.00
Hue                   1.71
Dilution              4.00
Proline            1680.00
dtype: float64

**df.idxmax()**

In [93]:
df['Alcohol'].idxmax()# this gives the index name where id is max, similar to which.max() in R

'r8'

In [95]:
df.idxmax() # if we do it on whole data frame, it will give the index value for each column, where max value occurs

Unnamed: 0         r177
Type               r130
Alcohol              r8
Malic              r123
Ash                r121
Alcalinity          r73
Magnesium           r95
Phenols             r52
Flavanoids         r121
Nonflavanoids      r105
Proanthocyanins    r110
Color              r158
Hue                r115
Dilution            r22
Proline             r18
dtype: object

**df.mean()**

In [96]:
df.mean(axis=0) # to get the mean of each column

Unnamed: 0          89.500000
Type                 1.938202
Alcohol             13.000618
Malic                2.336348
Ash                  2.366517
Alcalinity          19.494944
Magnesium           99.741573
Phenols              2.295112
Flavanoids           2.029270
Nonflavanoids        0.361854
Proanthocyanins      1.590899
Color                5.058090
Hue                  0.957449
Dilution             2.611685
Proline            746.893258
dtype: float64

**df.apply()**

df.apply(func, axis) can be used to apply any function across all columns or rows. similart to apply() in R.

functions can also be user defined functions.

In [98]:
df.apply(np.mean, 0)  # same as above result. 
#instead of np.mean,we could have applied any function here including user defined one

Unnamed: 0          89.500000
Type                 1.938202
Alcohol             13.000618
Malic                2.336348
Ash                  2.366517
Alcalinity          19.494944
Magnesium           99.741573
Phenols              2.295112
Flavanoids           2.029270
Nonflavanoids        0.361854
Proanthocyanins      1.590899
Color                5.058090
Hue                  0.957449
Dilution             2.611685
Proline            746.893258
dtype: float64

In [101]:
df.head(2)

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
r0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
r1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050

**df[ ].unique()**  to get all the unique elements in a column

In [99]:
df['Type'].unique() # lists all the unique elements in wine 'Type' column

array([1, 2, 3], dtype=int64)

**df[ ].nunique()** to obtain total # of unique elements

In [100]:
df['Type'].nunique() # total number of unique values

3

**df[ ].value_counts()** unique values and their frequencies

In [104]:
df['Type'].value_counts() # frequency of each unique value.  In R we simply use table(df['c1']) to get unique values

2    71
1    59
3    48
Name: Type, dtype: int64

**df.sort_values('column', axis)** To sort a dataframe based on a particular column

In [123]:
df.sort_values('Alcohol') # In R we can use the order() which gives sorted indices, which can then be used in df[order(),]

KeyError: 'Alcohol'

**df.groupby()** Another powerful method to group the data frame based on a column, and then apply some function

In [120]:
d = {"item":["chair", "desk", "rug", "table", "chair", "couch", "couch", "chair", "rug", "desk"], 
     "agent":["sally", "bob", "sally", "amy", "bob", "amy", "sally", "bob", "amy", "sally"],
      "sale_price": [100, 110, 200, 100, 150, 800, 1000, 100, 85, 110],
        "quantity": [10, 5, 15, 8, 20, 5, 4, 11, 9, 5]}

In [121]:
df = pd.DataFrame(d)
df['revenue'] = df['quantity']*df['sale_price']
df

    item  agent  sale_price  quantity  revenue
0  chair  sally         100        10     1000
1   desk    bob         110         5      550
2    rug  sally         200        15     3000
3  table    amy         100         8      800
4  chair    bob         150        20     3000
5  couch    amy         800         5     4000
6  couch  sally        1000         4     4000
7  chair    bob         100        11     1100
8    rug    amy          85         9      765
9   desk  sally         110         5      550

In [109]:
df.groupby("item").mean() # only quantity, sale_price, revenue are returned because they are numeric and agent is not.

       sale_price   quantity  revenue
item
chair  116.666667  13.666667   1700.0
couch  900.000000   4.500000   4000.0
desk   110.000000   5.000000    550.0
rug    142.500000  12.000000   1882.5
table  100.000000   8.000000    800.0

In [110]:
df.groupby("agent")['quantity', 'revenue'].sum() # we can also specify the columns on which we want the mean.

       quantity  revenue
agent
amy          22     5565
bob          36     4650
sally        34     8550

## 2.3 Boolean Masking Data Frames

In [124]:
boston = pd.read_csv('boston_housing.csv')

In [125]:
boston.shape

(506, 15)

In [126]:
boston.head(3)

,Unnamed: 0,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7

In [127]:
boston.describe()

,Unnamed: 0,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
count,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000
mean,252.500000,3.593761,11.363636,11.136779,0.069170,0.554695,6.284634,68.574901,3.795043,9.549407,408.237154,18.455534,356.674032,12.653063,22.532806
std,146.213884,8.596783,23.322453,6.860353,0.253994,0.115878,0.702617,28.148861,2.105710,8.707259,168.537116,2.164946,91.294864,7.141062,9.197104
min,0.000000,0.006320,0.000000,0.460000,0.000000,0.385000,3.561000,2.900000,1.129600,1.000000,187.000000,12.600000,0.320000,1.730000,5.000000
25%,126.250000,0.082045,0.000000,5.190000,0.000000,0.449000,5.885500,45.025000,2.100175,4.000000,279.000000,17.400000,375.377500,6.950000,17.025000
50%,252.500000,0.256510,0.000000,9.690000,0.000000,0.538000,6.208500,77.500000,3.207450,5.000000,330.000000,19.050000,391.440000,11.360000,21.200000
75%,378.750000,3.647422,12.500000,18.100000,0.000000,0.624000,6.623500,94.075000,5.188425,24.000000,666.000000,20.200000,396.225000,16.955000,25.000000
max,505.000000,88.976200,100.000000,27.740000,1.000000,0.871000,8.780000,100.000000,12.126500,24.000000,711.000000,22.000000,396.900000,37.970000,50.000000

In [129]:
boston.loc[(boston['RM'] > 8), 'MEDV' ] # finding MEDV when # of rooms are high > 8

97     38.7
163    50.0
204    50.0
224    44.8
225    50.0
226    37.6
232    41.7
233    48.3
253    42.8
257    50.0
262    48.8
267    50.0
364    21.9
Name: MEDV, dtype: float64

In [130]:
boston.loc[(boston['RM'] > 8), 'MEDV' ].mean()
# always remember to use .loc for rows when using names or booleans

44.2

In [131]:
boston.loc[boston['NOX'] > 0.8,'MEDV'].mean() # Finding the mean of MEDV where Nox is high.

16.425

In [132]:
boston.loc[boston['NOX'] < 0.4,'MEDV'].mean() # Finding the mean of MEDV where Nox is low.

24.54285714285714

**.ix allows a hybrid approach to indexing (hybrid between loc and iloc)**

In [ ]:
boston.ix[0:3, ['NOX','MEDV']]

In [ ]:
# when using multiple conditions, do not use 'and','or' instead use &, |
boston.loc[(boston["RM"]>8) & (boston["LSTAT"] < 3),:] # because and/or will work for entire object, not element wise comparison
# in R we use & anyway and it doesnt matter.

### 2.4 Modifying Data Frames

In [133]:
import numpy as np
import pandas as pd
df = pd.DataFrame([[0.1, 0.2, 0.3, 0.4], [1, 2, 3, 4], [10, 20, 30, 40]], index = 'r0 r1 r2'.split(), columns = 'c0 c1 c2 c3'.split())
df

      c0    c1    c2    c3
r0   0.1   0.2   0.3   0.4
r1   1.0   2.0   3.0   4.0
r2  10.0  20.0  30.0  40.0

In [134]:
df['c4'] = [0.5, 5, 50] # to add a new column
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

**.assign()** to include multiple new columns

In [135]:
dfnew = df.assign(c5 = [0.6, 6.0, 60], c6 = [0.7, 7.0, 70]) # change doesn't happen in place
dfnew

      c0    c1    c2    c3    c4    c5    c6
r0   0.1   0.2   0.3   0.4   0.5   0.6   0.7
r1   1.0   2.0   3.0   4.0   5.0   6.0   7.0
r2  10.0  20.0  30.0  40.0  50.0  60.0  70.0

**.append() to add by rows (column names should match if we do not want any missing values**)

In [136]:
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

In [137]:
df2 = pd.DataFrame([[7, 8, 9, 10, 11], [11, 21, 31, 41, 51]], index = 'r3 r4'.split(), columns = 'c0 c1 c2 c3 c4'.split())
df2

    c0  c1  c2  c3  c4
r3   7   8   9  10  11
r4  11  21  31  41  51

In [138]:
df.append(df2) # appending doesnt happen in place

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0
r3   7.0   8.0   9.0  10.0  11.0
r4  11.0  21.0  31.0  41.0  51.0

In [139]:
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

**.pop() can be used to remove a column**

In [140]:
df.pop("c4") # returns the popped column and mutates the original df

r0     0.5
r1     5.0
r2    50.0
Name: c4, dtype: float64

In [141]:
df

      c0    c1    c2    c3
r0   0.1   0.2   0.3   0.4
r1   1.0   2.0   3.0   4.0
r2  10.0  20.0  30.0  40.0

In [142]:
df["c4"] = [0.5, 5 ,50] # adding the column back
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

**.drop() can be used to remove a column or row**

In [143]:
df.drop("c4",axis=1) # to remove a column. 1 is for columns. Similarly we can delete rows as well. Deletion not happening in place.
# set inplace=True, in the argument if we want the original df to mutate.

      c0    c1    c2    c3
r0   0.1   0.2   0.3   0.4
r1   1.0   2.0   3.0   4.0
r2  10.0  20.0  30.0  40.0

In [144]:
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

In [145]:
df.drop(['c2','c4'],axis=1)

      c0    c1    c3
r0   0.1   0.2   0.4
r1   1.0   2.0   4.0
r2  10.0  20.0  40.0

In [146]:
df.drop('r2',0) # to remove a row

     c0   c1   c2   c3   c4
r0  0.1  0.2  0.3  0.4  0.5
r1  1.0  2.0  3.0  4.0  5.0

In [147]:
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

In [ ]:
df.drop(df.index[0:1],0) # to drop rows, by row index position. for columns we could similarly use df.columns

In [ ]:
del df['c3'] # del command can also be used to delete columns. happening in place. del also works for lists and dictionary

In [ ]:
df

In [ ]:
df

In [ ]:
df.iloc[1,1] = 100
df

### reset index

In [148]:
df = pd.DataFrame(np.random.randint(0,10,(2,3)), index = 'r0 r1'.split(), columns = 'c0 c1 c2'.split())
df

    c0  c1  c2
r0   0   7   9
r1   0   7   6

In [149]:
df.reset_index() # inplace = False by default

  index  c0  c1  c2
0    r0   0   7   9
1    r1   0   7   6

In [150]:
df

    c0  c1  c2
r0   0   7   9
r1   0   7   6

In [151]:
df.set_index("c2", inplace=True) # to set a column as index. if inplace=False, original df unchanged

In [152]:
df

    c0  c1
c2
9    0   7
6    0   7

In [153]:
df.index= ['a', 'b'] # to give a new index

In [154]:
df

   c0  c1
a   0   7
b   0   7

### Concatenating, Merging dataframes

In [ ]:
# for joining data frames, use concatenate and merge
# use merge if we just want to add dataframes by rows or columns as long as all the index and column names are same

**pd.concat** (for concatenating rows or columns to an existing data frame)

In [ ]:
df1 = pd.DataFrame(np.random.randn(3,4), index = 'r0 r1 r2'.split(), columns = 'c0 c1 c2 c3'.split())
df1

In [ ]:
df2 = pd.DataFrame(np.random.randn(3,4), index = 'r0 r1 r2'.split(), columns = 'c4 c5 c6 c7'.split())
df2

In [ ]:
pd.concat([df1,df2], axis=1) # axis = 1 for column, default is 0
# same row indexes, but differnt column names. We can use concat to join data frames together by column

In [ ]:
df1

In [ ]:
df3 = pd.DataFrame(np.random.randn(3,4), index = 'r3 r4 r5'.split(), columns = 'c0 c1 c2 c3'.split())
df3

In [ ]:
pd.concat([df1,df3], axis=0) # joining data frames by rows, column names must match here if we dont want any NaN

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.concat([df1,df2], axis=0) # we get NaN because to join by rows, the column names are different.

**merge**

In [ ]:
# if we want to merge by some common column, then we use merge

In [ ]:
df1 = pd.DataFrame([[1, 2, 3, 4], [2, 5, 6, 7], [3, 7, 5, 8]], columns = 'c0 c1 c2 c3'.split())
df1

In [ ]:
df2 = pd.DataFrame([[1, 21, 31, 41], [2, 51, 61, 71], [3, 71, 51, 81]], columns = 'c0 c5 c6 c7'.split())
df2

In [ ]:
df3 = pd.merge(df1,df2) # Pandas automatically recognizes that each data frame has a common 'c0' column. 
# we can also specify in the arguments that on = 'c0' 
df3

In [ ]:
df4 = pd.merge(df1,df2,how='inner', left_on = 'c0', right_on='c0') 
# left_on and right_on are used, when the column values might represent the same thing, but just the column names are different.
# here in this example, it doesnt matter, because c0 means same for both right and left columns.

In [ ]:
# There are many more merge operations, left join, right join, outer join etc..

## 2.5 Missing Values
* isnull(), isna()
* notnull(), notna()
* dropna()
* fillna()

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
d = {"c0": [1,2,3,7,np.nan,12], "c1": [4,12, 15, np.nan, 5, 8], "c2":[10, 11, np.nan, np.nan, 9, 12], "c3":[3,6,np.nan, 9, np.nan, 11]}
d

In [ ]:
df = pd.DataFrame(d)
df

**.isnull()**

In [ ]:
df.isnull() # To get a dataframe of boolean values. isna() gives the same result

In [ ]:
df.isnull().sum(axis=0) # to get a count of number of missing values in each column

**.notnull()**

In [ ]:
df.isnull()

**.dropna()**

In [ ]:
df.dropna() # select rows without any NaN values. axis = 0 is the default argument. default inplace = False

In [ ]:
df

In [ ]:
df.dropna(axis=1) # select columns without any NaN values

In [ ]:
df

In [ ]:
df.dropna(axis = 0, thresh=3) #here thresh is for non-NA values

In [ ]:
df.dropna(axis=1, thresh=5) # look at all columns, and get any column which has atleast 5 non missing values

**fillna()**

In [ ]:
df.fillna(100) # fill missing values with a constant

In [ ]:
df.mean(axis=0)

In [ ]:
df.fillna(df.mean(axis=0),axis=0) # fill na with mean values in each column. default inplace=False

In [ ]:
df

In [ ]:
df.fillna(method='ffill') # similarly we have 'bfill'

## 2.6 Numerical operations on Data Frames

In [ ]:
df1 = pd.DataFrame(np.random.randint(0,10,(3,4)), index = 'r0 r1 r2'.split(), columns='c0 c1 c2 c3'.split())
df2 = pd.DataFrame(np.random.randint(0,10,(3,4)), index = 'r0 r1 r2'.split(), columns='c0 c1 c2 c3'.split())
print (df1, '\n')
print (df2)

In [ ]:
df1 + 8 # broadcasting operations similar to numpy arrays.

In [ ]:
df1

In [ ]:
df1 + df2

**any Numpy Ufunc, will work on Pandas Series and DataFrames**

In [ ]:
np.exp(df1) # we can also apply Numpy Ufuncs directly on Pandas series or data frames.

## reading and writing

In [ ]:
# typically pd.read_ will give many options to read and df.to_ many options to write
# pd.read_csv, pd.read_excel, df.to_csv etc..

In [ ]:
boston.to_csv('boston_copy.csv')